# https://www.acmicpc.net/problem/15656
import sys

input = sys.stdin.readline

tetrominos = [
    # 직선
    [[0, 0], [0, 1], [0, 2], [0, 3]],
    [[0, 0], [1, 0], [2, 0], [3, 0]],
    # 네모
    [[0, 0], [0, 1], [1, 0], [1, 1]],
    # 요철
    [[0, 0], [0, 1], [0, 2], [1, 1]],
    [[0, 0], [1, 0], [2, 0], [1, 1]],
    [[1, 0], [0, 1], [1, 1], [2, 1]],
    [[0, 1], [1, 0], [1, 1], [1, 2]],
    # 지네
    [[0, 0], [0, 1], [1, 1], [1, 2]],
    [[1, 0], [2, 0], [0, 1], [1, 1]],
    [[0, 0], [1, 0], [1, 1], [2, 1]],
    [[1, 0], [1, 1], [0, 1], [0, 2]],
    # ㄱ자 서 있는거
    [[0, 0], [1, 0], [2, 0], [0, 1]],
    [[0, 0], [1, 0], [2, 0], [2, 1]],
    [[0, 0], [0, 1], [1, 1], [2, 1]],
    [[2, 0], [0, 1], [1, 1], [2, 1]],
    # ㄱ자 누워 있는거
    [[0, 0], [0, 1], [0, 2], [1, 0]],
    [[0, 0], [0, 1], [0, 2], [1, 2]],
    [[0, 0], [1, 0], [1, 1], [1, 2]],
    [[0, 2], [1, 0], [1, 1], [1, 2]]
]

n, m = map(int, input().split())

board = []

maximum = 0

for i in range(n):
    board.append(list(map(int, input().split())))

for tetromino in tetrominos:

    for y in range(n):
        for x in range(m):
            try:
                sum = 0
                for block in tetromino:
                    sum += board[block[0] + y][block[1] + x]
                if sum > maximum:
                    maximum = sum
            except:
                continue

print(maximum)

#양이 적어보이니까 직접 다 대입해도 괜춘하다. 이런 방식으로 푸는것 보다 당연히 더 정교한 방식이 있겠지만 생각할 시간에 하나라도 더 푸는게 중요
